# Pandas_school_Jul30.py
import pandas as pd

df0 = pd.DataFrame({
    'ФИО       ': ['Петров А.   ', 'Ларичев Ю.  ', 'Иванов И.   ', 'Смирнов К.  ', 'Владимиров А',
                   'Машуков Д.  ', 'Попович А.  ', 'Абаковский Ю', 'Михаилов И. ', 'Кузьмин К.  '  ],
    'Математика': [   3,            4,               5,             3,             4,
                      2,            2,               2,             3,             3 ],
    'Иностр.яз.': [   5,            5,               3,             2,             0,
                      1,            1,               2,             1,             2 ],
    'Литература': [   5,            5,               5,             5,             5,
                      5,            3,               3,             5,             5 ],
    'История':    [   5,            4,               5,             5,             5,
                      3,            3,               3,             3,             3],
    'Спорт':      [   5,            5,               5,             5,             5,
                      5,            5,               5,             5,             5 ]
} )

print("\n----------- 1) Оценки учеников (исходные данные)  ------------")
print(df0)

df = df0.sort_values(by="ФИО       ")
#
# df_dict = df.to_dict()
# print(f"\n --- df_dict=\n {df_dict}")
# df_np = df.to_numpy()
# print(f"\n --- df_np=\n {df_np}")
# print(f"\n --- All col[0] df_np[0:10, :1]=\n {df_np[0:10, :1]}")
# print(f"\n --- All col - No Fiu: df_np[0:10, 1:6]=\n {df_np[0:10, 1:6]}")
#


# df.reset_index(drop=True, inplace=True)
print("\n----------- 2) Оценки учеников (Отсортированные по ФИО) ------------")
print(df)
print("-----------------------------------")

df02 = df.loc[2].to_frame().T
print(df02)
print("-----------------------------------")

df_mean = df.iloc[0:10, 1:7]  # срез: все ученки, оценки по всем предметам

print("\n----------- 3) математические величины по предметам ------------")
print(df.describe())
# ---------------------------------------------------

dx_res = df.describe()
dx1 = dx_res.iloc[1]  # mean
dx5 = dx_res.iloc[5]  # median
dx4 = dx_res.iloc[4]  # Q1 = 25%
dx6 = dx_res.iloc[6]  # Q3 = 75%
dx2 = dx_res.iloc[2]  # std
dx4.name = "Q1(25%)"
dx6.name = "Q3(75%)"
dx5.name = "median "

print(f"\n Средняя оценка по каждому предмету: \n{dx1}")
print(f"\n Медианная оценка по каждому предмету: \n{dx5}")
print(f"\n Стандартное отклонение оценок по каждому предмету: \n{dx2}")
print(f"\n Q1(25%) по каждому предмету: \n{dx4}")
print(f"\n Q3(75%) по каждому предмету: \n{dx6}")
